---
type: FaceArray
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# FaceArray

`Autodesk.Revit.DB.FaceArray` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FaceArray | — | `public FaceArray ()` |
| Method | Append | — | `public virtual void Append ( Face item )` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | ForwardIterator | — | `public virtual FaceArrayIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual void Insert ( Face item , int index )` |
| Method | ReverseIterator | — | `public virtual FaceArrayIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Item | — | `public virtual Face this [ int index ] { get ; set ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |